In [4]:
import pandas as pd
courses=pd.Series(['Fullstack','Data science','Java'])
fees=pd.Series([3000,3500,2700])
discount=pd.Series([2000,1500,2500])
df=pd.concat([courses,fees,discount],axis=1)

In [5]:
df

              0     1     2
0     Fullstack  3000  2000
1  Data science  3500  1500
2          Java  2700  2500

In [6]:
# we can create a dataframe by multiple series by appending each series as a column s to dataframe by concat() method